/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine이 백업을 완료할 수 없습니다.";

/* error dialog buttons */
OK = "승인";
PREFERENCES = "Time Machine 환경설정 열기...";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "관리되는 환경설정이 이 컴퓨터에 있는 Time Machine 설정을 제어하고 있습니다. 시스템 관리자에게 문의하십시오.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "오류 없음.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Time Machine을 실행할 수 없습니다.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "백업을 완료할 수 없습니다. 백업 폴더를 생성하는 동안 오류가 발생했습니다."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "백업 디스크가 필요한 Mac OS 확장(저널링) 포맷이 아닙니다.\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "다른 백업 디스크를 선택하려면 Time Machine 환경설정을 여십시오.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "백업 디스크 상태를 가져올 수 없습니다."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "백업 디스크에 활성화된 소유권이 없습니다. Time Machine 백업으로 이 디스크를 사용하려면 활성화된 소유권이 있어야 합니다.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "다른 백업 디스크를 선택하려면 Time Machine 환경설정을 여십시오.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "백업 디스크에 필요한 Mac OS 확장(저널링) 포맷이 없습니다.\n\n%@";
RESULTCODE_6_SHOWPREFS = "다른 백업 디스크를 선택하려면 Time Machine 환경설정을 여십시오."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "이 백업의 크기는 백업 디스크에 비해 너무 큽니다. 이 백업에는 %@의 공간이 필요하지만 현재 %@의 공간만 사용 가능합니다.\n\n%@";
RESULTCODE_7_SHOWPREFS = "Time Machine을 사용하려면 백업 디스크에 백업 항목을 저장할 수 있는 사용 공간이 남아 있어야 합니다. Time Machine 환경설정을 열고 용량이 더 큰 백업 디스크를 선택하거나 파일을 삭제하여 백업 용량을 줄이십시오."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "“읽기 전용”인 파일을 백업 디스크에 복사할 수 없습니다.\n\n%@";
RESULTCODE_8_SHOWPREFS = "디스크 유틸리티를 사용하여 해당 디스크를 복구하거나 재포맷하십시오. 디스크가 복구되지 않는 경우 백업을 위해 다른 디스크를 사용해야 합니다. Time Machine 환경설정을 열고 다른 백업 디스크를 선택하십시오."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "백업 디스크에 필요한 활성화된 연결 제어 목록이 없습니다.\n\n%@";
RESULTCODE_9_SHOWPREFS = "다른 백업 디스크를 선택하려면 Time Machine 환경설정을 여십시오."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "백업을 준비하는 동안 오류가 발생했습니다."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "파일을 백업 디스크에 복사하는 중 오류가 발생하였기 때문에 백업을 수행할 수 없습니다.";
RESULTCODE_11_MESSAGE = "일시적인 문제가 있습니다. 나중에 다시 백업을 시도하십시오. 문제가 계속 발생하면 디스크 유틸리티를 사용하여 백업 디스크를 복구하십시오.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "백업 디스크에 있는 파일에 연결하는 동안 오류가 발생했습니다."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "백업 중에 너무 많은 파일이 변경되었습니다."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "백업 디스크에서 만료된 백업을 제거하는 동안 오류가 발생했습니다.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "만료된 모든 백업을 제거했지만 백업 디스크가 여전히 가득 찬 상태입니다.\n\n%@";
RESULTCODE_15_SHOWPREFS = "대용량 백업 디스크를 선택하려면 Time Machine 환경설정을 여십시오.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "만료된 모든 백업을 제거했지만 백업 디스크가 여전히 가득 찬 상태입니다.\n\n%@";
RESULTCODE_16_SHOWPREFS = "대용량 백업 디스크를 선택하려면 Time Machine 환경설정을 여십시오."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "선택된 백업 디스크가 없습니다.\n\n%@";
RESULTCODE_17_SHOWPREFS = "백업 디스크를 선택하려면 Time Machine 환경설정을 여십시오.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "백업 디스크를 찾을 수 없습니다.\n\n%@";
RESULTCODE_18_SHOWPREFS = "백업 디스크가 연결되어 있는 지 확인하거나 Time Machine 환경설정을 열고 다른 백업 디스크를 선택하십시오."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "백업 디스크를 사용할 수 없습니다."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "“%@” 백업 디스크 이미지를 생성할 수 없습니다(오류 %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "“%@” 백업 디스크 이미지에 연결할 수 없습니다(오류 %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "백업이 취소되었습니다."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "백업 중인 디스크는 대소문자를 구분하지만 백업 디스크는 그렇지 않습니다.\n\n%@";
RESULTCODE_23_SHOWPREFS = "다른 백업 디스크를 선택하거나 대소문자를 구분하는 디스크를 백업하지 않으려면 Time Machine 환경설정을 여십시오."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "백업할 디스크 중 두 개가 동일한 이름을 가지고 있습니다. 둘 중 하나의 이름을 변경하십시오."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "백업이 가능한 디스크가 없습니다. 이 문제는 모든 디스크가 “백업 안 함” 목록에 있는 경우 발생합니다.\n\n%@";
RESULTCODE_25_SHOWPREFS = "목록을 편집하려면 Time Machine 환경설정을 열고 옵션을 클릭하십시오.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "네트워크 문제 때문에 Time Machine이 백업을 완료할 수 없습니다.";
RESULTCODE_26_MESSAGE = "사용자의 컴퓨터와 백업 디스크가 동일한 네트워크에 있는지 그리고 백업 디스크가 켜져 있는지 확인하십시오. 그런 다음 백업을 다시 시도하십시오.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "백업 디스크가 컴퓨터에서 추출되었거나 연결 해제되었을 수 있습니다.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "백업 디스크에 예기치 않게 공간이 부족합니다. Time Machine이 예정된 다음 백업을 진행하는 동안 만료된 백업을 제거하여 추가 공간을 확보합니다.\n\n%@";
RESULTCODE_28_SHOWPREFS = "대용량 백업 디스크를 선택하거나 파일을 제거하여 백업된 용량을 줄이려면 Time Machine 환경설정을 여십시오."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "네트워크 사용자 이름 또는 암호에 문제가 있기 때문에 네트워크 백업 디스크에 연결할 수 없습니다.\n\n%@";
RESULTCODE_29_SHOWPREFS = "네트워크 백업 디스크를 선택하고 올바른 사용자 이름 및 암호를 다시 입력하려면 Time Machine 환경설정을 여십시오.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "“%@” 백업을 다시 사용하는 동안 오류가 발생했습니다.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "“%@” 백업 디스크 이미지가 이미 사용 중입니다.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "“%@” 백업 디스크 이미지를 찾을 수 없습니다.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "시스템 날짜 및 시간이 올바르지 않습니다.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "컴퓨터에 주요 네트워크 인터페이스가 없습니다.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine이 일부 Time Machine 설정을 찾을 수 없습니다.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Time Machine 설정을 재구성하려면, Time Machine 환경설정을 열고 백업 디스크를 다시 선택하십시오.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine이 “%@” 백업 디스크에서 일부 Time Machine 설정을 찾을 수 없습니다.\n\n백업 디스크가 연결되어 있는 지 그리고 연결된 다른 디스크가 백업 디스크와 동일한 이름을 사용하고 있지는 않는 지 확인하십시오.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Time Machine 설정을 재구성하려면, Time Machine 환경설정을 열고 백업 디스크를 다시 선택하십시오.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "백업 중인 디스크 중 하나가 컴퓨터에서 추출되었거나 연결 해제되었을 수 있습니다.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "쓰기를 할 수 없기 때문에, Time Machine에서 디스크 이미지를 사용할 수 없습니다.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "백업 디스크를 사용할 수 없기 때문에 Time Machine이 백업을 확인할 수 없습니다.";
RESULTCODE_40_MESSAGE = "사용자의 컴퓨터와 백업 디스크가 동일한 네트워크에 있는지 그리고 백업 디스크가 켜져 있는지 확인하십시오. 그런 다음에 백업을 다시 확인해 보십시오.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine이 백업을 확인할 수 없습니다.";
RESULTCODE_41_MESSAGE = "백업 디스크가 “읽기 전용”인 것 같습니다.";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "확인하는데 방해를 받았기 때문에 Time Machine이 백업을 확인할 수 없습니다.";
RESULTCODE_42_MESSAGE = "대체로 네트워크 문제로 인해 방해가 발생합니다. 네트워크 문제가 해결된 후에 다시 시도하십시오.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine이 기존 백업 디스크 이미지 “%@”을(를) 따로 이동할 수 없습니다.";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine이 “%@” 백업 디스크 이미지를 삭제할 수 없습니다.";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "오류 코드: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "백업 디스크가 거의 찼습니다.";
RESULTCODE_1000_MESSAGE = "백업 디스크가 가득 차면, Time Machine이 새로운 백업 공간을 확보하기 위해 이전 백업을 삭제합니다.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "이전 백업을 모두 유지하려면, Time Machine 환경설정을 열고 새로운 백업 디스크를 선택하십시오.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "백업 디스크가 가득 찼습니다.";
RESULTCODE_1001_MESSAGE = "새로운 백업을 위한 공간을 늘리기 위해 Time Machine이 하나 이상의 이전 백업을 삭제했습니다. 남아있는 가장 이전 백업: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "이전 백업이 추가로 삭제되는 것을 피하려면, Time Machine 환경설정을 열고 다른 백업 디스크를 선택하십시오."; 
RESULTCODE_1001_CHECKBOX = "이 경고를 다시 보지 않음.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine이 %@일 동안 사용자의 컴퓨터를 백업하지 않았습니다.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "백업 디스크가 사용 가능한 지 확인하거나 Time Machine 환경설정을 열고 새로운 백업 디스크를 선택하십시오.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "이 컴퓨터에서 “%@” 백업을 다시 사용하겠습니까?";
RESULTCODE_1003_MESSAGE = "다른 컴퓨터에서 백업이 생성되었습니다. 이 백업을 다시 사용하면 기존 컴퓨터에서 더 이상 이 백업을 사용할 수 없습니다.";
REUSE_BACKUP_BUTTON = "백업 재사용";
CREATE_NEW_BACKUP_BUTTON = "새로운 백업 생성";
ASK_LATER_BUTTON = "지금 백업 안 함";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "“%@”에 대해 사용 가능한 업데이트가 있습니다.";
RESULTCODE_1004_MESSAGE = "이 업데이트는 Time Capsule 신뢰성을 향상시킵니다. 이 업데이트를 설치하려면, AirPort 유틸리티를 엽니다. “%@”에 대한 Time Capsule 암호를 제공해야 할 수도 있습니다.";
REMIND_LATER_BUTTON = "나중에 업데이트";
AIRPORT_UTILITY_BUTTON = "AirPort 유틸리티 열기…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine이 사용자 백업 확인을 완료했습니다. 신뢰성을 향상시키려면, Time Machine에서 새로운 백업을 생성해야 합니다.";
RESULTCODE_1006_MESSAGE = "새로운 백업을 생성하려면, 새로운 백업 시작을 클릭하십시오. 기존의 백업 기록이 제거됩니다. 이 작업을 완료하는데 몇 시간이 걸릴 수 있습니다.\n\n나중에 백업을 클릭하면 내일 다시 이에 대해 알려줍니다. Time Machine은 그 사이에 백업을 수행하지 않습니다.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "새로운 백업 시작";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "나중에 백업";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "이전 백업 이후로 백업 디스크의 신원이 변경되었습니다.";
RESULTCODE_1008_MESSAGE = "이 디스크는 대치되었거나 지워졌을 수 있습니다. 또는 누군가가 잘못된 디스크에 백업하도록 사용자의 컴퓨터를 속이려고 했을 수도 있습니다.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "이 디스크 사용";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "백업 안 함";

// UNITS
KB = "KB";
MB = "MB";
GB = "GB";
TB = "TB";
